mattsed/Bachelorarbeit_STM32/Core/Src/app/app.c
#include "app/app.h"

#include <stdio.h>
#include <string.h>

#include "stm32h5xx_nucleo.h"   /* BSP_LED_* fuer die gelbe Fix-Anzeige (LD2) */

#include "board/board.h"
#include "sensors/acc_adxl373.h"
#include "sensors/brake_pressure.h"
#include "sensors/gnss.h"
#include "sensors/imu_lsm6dso.h"
#include "storage/storage_logger.h"

/* Messtakt: alle 20 ms ein kompletter Datensatz (50 Hz). GNSS aktualisiert
 * sich selbst nur mit 1 Hz; jede Zeile traegt den letzten bekannten Stand. */
#define APP_SAMPLE_PERIOD_MS  20u
#define APP_LED_PERIOD_MS     500u
#define APP_BUTTON_DEBOUNCE_MS 50u

/* SD-Fehlerbehandlung: schnelles LED-Blinken signalisiert den Fehler am
 * Lenker, alle 2 s ein Wiederherstellungsversuch (Karte neu initialisieren,
 * neue Logdatei). Haeufiger lohnt nicht und wuerde die Messschleife bremsen. */
#define APP_LED_ERROR_PERIOD_MS   100u
#define APP_SD_RECOVER_PERIOD_MS  2000u

/* true, solange ein SD-Schreibfehler ansteht und die Wiederherstellung
 * noch nicht geglueckt ist. */
static bool app_sd_error = false;

/* --------------------------------------------------------------------------
 * Unabhaengiger Watchdog (IWDG): eigener Zaehler auf dem internen LSI-
 * Oszillator (~32 kHz), der den MCU zuruecksetzt, wenn er nicht regelmaessig
 * "gefuettert" wird -- schuetzt im Feld gegen haengende Firmware (z. B.
 * blockierter SPI-Bus nach Wackelkontakt). Direkte Registerzugriffe statt
 * HAL, weil das IWDG-HAL-Modul im CubeMX-Projekt deaktiviert ist und eine
 * Aktivierung in stm32h5xx_hal_conf.h bei der naechsten Code-Generierung
 * verloren ginge. Einmal gestartet laesst sich das IWDG nicht mehr stoppen.
 * 32 kHz / 256 (Vorteiler) = 125 Hz Zaehltakt; Reload 500 => ~4 s Timeout.
 * -------------------------------------------------------------------------- */
#define APP_IWDG_KEY_ENABLE     0x0000CCCCu  /* Schluesselwerte laut Referenzhandbuch */
#define APP_IWDG_KEY_ACCESS     0x00005555u
#define APP_IWDG_KEY_REFRESH    0x0000AAAAu
#define APP_IWDG_PRESCALER_256  6u
#define APP_IWDG_RELOAD_4S      500u

static void app_watchdog_start(void)
{
  /* Watchdog anhalten, solange der Debugger die CPU stoppt -- sonst wuerde
   * jeder Breakpoint nach 4 s einen Reset ausloesen. */
  __HAL_DBGMCU_FREEZE_IWDG();

  IWDG->KR  = APP_IWDG_KEY_ENABLE;  /* startet Zaehler, LSI laeuft automatisch an */
  IWDG->KR  = APP_IWDG_KEY_ACCESS;  /* PR/RLR zum Beschreiben freischalten */
  IWDG->PR  = APP_IWDG_PRESCALER_256;
  IWDG->RLR = APP_IWDG_RELOAD_4S;

  /* Die Register liegen in der langsamen LSI-Taktdomaene; SR zeigt an,
   * solange die Uebernahme laeuft. Danach den Zaehler frisch laden. */
  uint32_t start = HAL_GetTick();
  while (IWDG->SR != 0u)
  {
    if ((HAL_GetTick() - start) > 50u)
    {
      break;
    }
  }
  IWDG->KR = APP_IWDG_KEY_REFRESH;
  printf("[App] Watchdog aktiv (Reset nach ~4 s ohne Lebenszeichen).\r\n");
}

/* B1-USER-Knopf (PC13): STARTET die Aufzeichnung. Nach dem Einschalten
 * bzw. Kartenstecken ist der Logger nur BEREIT (LED dauerhaft an) --
 * es wird erst geloggt, wenn wirklich B1 gedrueckt wurde. Gestoppt wird
 * mit dem anderen Knopf: Der schwarze RESET beendet die Aufzeichnung
 * und bootet zurueck in den Bereit-Zustand. Waehrend der Aufzeichnung
 * macht B1 bewusst nichts (kein versehentlicher Stopp am Lenker).
 * Ausgewertet wird der entprellte Wechsel auf "gedrueckt" (Pegel high). */
/* Gelbe LED (LD2) zeigt den GNSS-Fix an: an = gueltige Position, aus = kein
 * Fix. Zusaetzlich meldet die Konsole jeden Wechsel -- aber nur den Wechsel,
 * damit sie im Dauerbetrieb lesbar bleibt.
 *
 * WARUM: Ohne diese Anzeige merkt man erst am PC, dass die Aufzeichnung vor
 * dem ersten Fix gestartet wurde. gnss_read() liefert dann NOT_READY bzw.
 * fix_valid = 0, und weil app_run() den Datensatz vorher nullt, bleiben
 * fix, lat, lon, v und utc der betroffenen Zeilen komplett auf 0. */
static void app_update_gnss_indicator(void)
{
  static bool last_fix = false;
  static bool first_call = true;

  bool fix = gnss_has_fix();

  if (!first_call && fix == last_fix)
  {
    return;
  }
  first_call = false;
  last_fix = fix;

  if (fix)
  {
    BSP_LED_On(LED_YELLOW);
    printf("[GNSS] Fix erhalten -- Position gueltig, Aufzeichnung sinnvoll.\r\n");
  }
  else
  {
    BSP_LED_Off(LED_YELLOW);
    /* Unterscheiden, ob nur der Fix fehlt (warten hilft) oder das Modul gar
     * nicht antwortet (Hardware/Power-Cycle noetig) -- das ist der
     * Unterschied zwischen "gleich gehts los" und "so wird das nichts". */
    if (gnss_is_ready())
    {
      printf("[GNSS] kein Fix -- GNSS-Spalten der CSV bleiben 0.\r\n");
    }
    else
    {
      printf("[GNSS] Modul nicht bereit -- gar keine Positionsdaten.\r\n");
    }
  }
}

static void app_check_user_button(void)
{
  static GPIO_PinState stable_state = GPIO_PIN_RESET;
  static GPIO_PinState last_raw = GPIO_PIN_RESET;
  static uint32_t last_change_ms = 0;

  GPIO_PinState raw = HAL_GPIO_ReadPin(GPIOC, GPIO_PIN_13);
  uint32_t now = HAL_GetTick();

  /* Schritt 1: Bei jeder Pegelaenderung nur den Zeitpunkt merken --
   * das mechanische Prellen des Kontakts erzeugt hier viele schnelle
   * Wechsel, die alle wieder von vorn zaehlen. */
  if (raw != last_raw)
  {
    last_raw = raw;
    last_change_ms = now;
    return;
  }
  /* Schritt 2: Erst wenn der Pegel 50 ms lang stabil war UND sich vom
   * zuletzt akzeptierten Zustand unterscheidet, gilt er als echt. */
  if ((now - last_change_ms) < APP_BUTTON_DEBOUNCE_MS || raw == stable_state)
  {
    return;
  }
  stable_state = raw;

  /* Schritt 3: Nur die Flanke "losgelassen -> gedrueckt" schaltet um
   * (das Loslassen selbst loest nichts aus). */
  if (stable_state == GPIO_PIN_SET) /* Knopf gedrueckt */
  {
    if (app_sd_error)
    {
      /* Im Fehlerfall bricht B1 die Wiederherstellungsversuche ab und
       * kehrt in den Bereit-Zustand zurueck. */
      app_sd_error = false;
      (void)storage_logger_stop();
      printf("[App] Fehlerzustand verworfen -- bereit (Start per B1).\r\n");
    }
    else if (!storage_logger_is_ready())
    {
      if (storage_logger_start() == APP_STATUS_OK)
      {
        printf("[App] Aufzeichnung gestartet -- Stopp per RESET-Knopf.\r\n");
        /* Bewusst nur warnen, nicht blockieren: am Berg ist eine Fahrt ohne
         * GNSS immer noch besser als keine Aufzeichnung. */
        if (!gnss_has_fix())
        {
          printf("[App] WARNUNG: noch kein GNSS-Fix (gelbe LED aus) -- "
                 "Position und Geschwindigkeit fehlen bis zum ersten Fix.\r\n");
        }
      }
    }
    /* Waehrend laufender Aufzeichnung macht B1 nichts (Stopp per RESET). */
  }
}

app_status_t app_init(void)
{
  /* Reset-Ursache auswerten, BEVOR die Flags geloescht werden. Der Watchdog
   * setzt ein eigenes Flag, das sich von einem Druck auf RESET und vom
   * Einschalten unterscheiden laesst -- und genau diese Unterscheidung
   * entscheidet, ob die Aufzeichnung von selbst weiterlaufen soll. */
  bool war_watchdog_reset = (__HAL_RCC_GET_FLAG(RCC_FLAG_IWDGRST) != 0u);

  if (war_watchdog_reset)
  {
    printf("[App] ACHTUNG: Neustart wurde vom Watchdog ausgeloest (Firmware hing).\r\n");
  }
  __HAL_RCC_CLEAR_RESET_FLAGS();

  /* Alle Module einmalig initialisieren. Die Rueckgabewerte werden bewusst
   * verworfen ((void)-Cast): Ein fehlgeschlagenes Modul (z. B. keine
   * SD-Karte) soll den Start der uebrigen nicht verhindern. Jedes Modul
   * meldet seinen Status selbst per printf auf der Konsole. */
  (void)board_init();
  (void)gnss_init();

  /* Diagnose 16.08.2026: schneidet den rohen NMEA-Strom mit und zaehlt die
   * Satzarten. Hat gezeigt, dass RMC sauber ankommt und der Fix nach wenigen
   * Sekunden kommt -- die leeren GNSS-Spalten kamen also vom Start VOR dem
   * ersten Fix, nicht vom Parser. Blockiert 10 s, daher normalerweise aus;
   * zum Nachsehen des Satzprofils wieder einkommentieren. */
  /* (void)gnss_dump_stream(10000u); */

  /* Bring-up-Diagnose: Firmware-Version des GNSS-Moduls abfragen. Stand
   * 11.08.2026 deaktiviert -- der Teseo nimmt I2C-Schreibzugriffe in der
   * Werkskonfiguration nicht an (Analyse im Kommentar bei
   * gnss_send_command in gnss.c). Zum Weitersuchen einkommentieren. */
  /* (void)gnss_query_version(); */

  /* Bring-up des UART-Wegs zum Teseo (Baudratensuche + Versionsabfrage).
   * Am 11.08.2026 lieferte das an PB7 keinerlei Flanken. Ursache am
   * 16.08.2026 gefunden: R3 auf dem X-NUCLEO-LIV4A1 ist unbestueckt und
   * unterbricht die Leitung Modul-TX -> Arduino-Header (am Board sichtbar
   * bestaetigt).
   *
   * Seit dem UART-Umbau ueberfluessig: gnss_init() sucht die Baudrate
   * selbst und waehlt UART als Quelle, sobald dort NMEA ankommt. Diese
   * Funktion bleibt nur als Diagnose stehen (sie fragt zusaetzlich die
   * Firmware-Version ab). */
  /* (void)gnss_uart_bringup(); */
  (void)brake_pressure_init();

  /* Nach einem Watchdog-Reset waehrend der Fahrt darf die Gyro-Bias-Messung
   * nicht laufen: Sie setzt Stillstand voraus und wuerde sonst echte Drehung
   * als Nullpunktfehler festhalten. Nebeneffekt: Der Start verkuerzt sich um
   * rund 2 s, die Datenluecke wird also kleiner. */
  imu_lsm6dso_set_bias_calibration(!war_watchdog_reset);
  (void)imu_lsm6dso_init();
  (void)acc_adxl373_init();
  (void)storage_logger_init();

  if (storage_logger_is_available())
  {
    printf("[App] Bereit (%u Hz) -- Aufzeichnung mit B1 starten, Stopp per RESET.\r\n",
           (unsigned int)(1000u / APP_SAMPLE_PERIOD_MS));
  }
  else
  {
    printf("[App] Kein Logging moeglich (microSD nicht bereit) -- nur Sensor-Poll.\r\n");
  }

  /* Nach einem Watchdog-Reset die Aufzeichnung selbsttaetig fortsetzen.
   *
   * WARUM: Ein Watchdog-Reset ist ein vollstaendiger Neustart -- der RAM und
   * damit der komplette Zustand sind weg, das Geraet landet im Bereit-
   * Zustand und wartet auf B1. Waehrend einer Abfahrt drueckt den niemand.
   * Ohne diesen Zweig endet die Messung an der Stelle, an der die Firmware
   * gehangen hat, und man merkt es erst am PC. Der Watchdog soll das System
   * ohne Zutun wieder flottmachen; wartet er danach auf einen Tastendruck,
   * erfuellt er seinen Zweck nur halb.
   *
   * NUR beim Watchdog, nicht bei RESET oder Einschalten: Ein Druck auf
   * RESET ist der vorgesehene Weg, eine Messung zu BEENDEN. Wuerde danach
   * automatisch eine neue beginnen, liesse sich die Aufzeichnung gar nicht
   * mehr stoppen.
   *
   * Es entsteht eine neue Logdatei mit fortlaufender Nummer; aus einer
   * unterbrochenen Fahrt werden also zwei Dateien.
   *
   * DATENLUECKE rund 6 s: bis zu 4 s, bis der Watchdog den Stillstand
   * bemerkt, plus rund 2 s fuer Reset und Initialisierung (gemessen am
   * Board: 4,2 s bis "Bereit", davon 2,2 s Gyro-Bias-Messung, die hier
   * entfaellt). Fuer die Auswertung ist das deutlich besser als ein
   * Abbruch der gesamten Fahrt. */
  if (war_watchdog_reset && storage_logger_is_available())
  {
    if (storage_logger_start() == APP_STATUS_OK)
    {
      printf("[App] Aufzeichnung nach Watchdog-Reset selbsttaetig fortgesetzt "
             "(neue Datei, Luecke rund 6 s, kein Gyro-Bias).\r\n");
    }
    else
    {
      printf("[App] Fortsetzen nach Watchdog-Reset fehlgeschlagen -- "
             "Aufzeichnung mit B1 starten.\r\n");
    }
  }

  /* Watchdog bewusst erst NACH allen Modul-Inits scharf schalten:
   * gnss_init() darf bis zu 6 s blockieren -- laenger als der 4-s-Timeout. */
  app_watchdog_start();

  return APP_STATUS_OK;
}

void app_run(void)
{
  static uint32_t next_sample_ms = 0;
  static uint32_t next_led_ms = 0;

  /* Watchdog fuettern: einmal pro Schleifendurchlauf (auch im gestoppten
   * Zustand -- die Schleife laeuft dort weiter). Bleibt dieser Aufruf ~4 s
   * aus, haengt die Firmware und der Watchdog resettet den MCU. */
  IWDG->KR = APP_IWDG_KEY_REFRESH;

  /* Hintergrundaufgaben: NMEA-Strom leeren, Fix-Anzeige nachfuehren,
   * Start/Stopp-Knopf auswerten. */
  (void)gnss_poll();
  app_update_gnss_indicator();
  app_check_user_button();

  uint32_t now = HAL_GetTick();

  /* Nach einem SD-Fehler: ratenbegrenzt versuchen, Karte und Logging
   * wiederherzustellen (z. B. nachdem die Karte neu gesteckt wurde). */
  static uint32_t next_recover_ms = 0;
  if (app_sd_error && now >= next_recover_ms)
  {
    next_recover_ms = now + APP_SD_RECOVER_PERIOD_MS;
    if (storage_logger_recover() == APP_STATUS_OK)
    {
      app_sd_error = false;
      printf("[App] SD wiederhergestellt -- Logging laeuft in neuer Datei weiter.\r\n");
    }
  }

  /* Gruene LED (PB0): blinkt langsam = Aufzeichnung laeuft, dauerhaft an =
   * gestoppt, blinkt schnell = SD-Fehler (am Lenker sofort erkennbar). */
  if (app_sd_error)
  {
    if (now >= next_led_ms)
    {
      next_led_ms = now + APP_LED_ERROR_PERIOD_MS;
      HAL_GPIO_TogglePin(GPIOB, GPIO_PIN_0);
    }
  }
  else if (storage_logger_is_ready())
  {
    if (now >= next_led_ms)
    {
      next_led_ms = now + APP_LED_PERIOD_MS;
      HAL_GPIO_TogglePin(GPIOB, GPIO_PIN_0);
    }
  }
  else
  {
    HAL_GPIO_WritePin(GPIOB, GPIO_PIN_0, GPIO_PIN_SET);
  }

  /* Messtakt: erst wenn die naechste 20-ms-Marke erreicht ist, geht es
   * weiter -- sonst endet die Schleifenrunde hier. Der naechste Termin wird
   * relativ zum vorigen fortgeschrieben (nicht relativ zu "jetzt"), damit
   * sich kleine Verspaetungen nicht aufsummieren. */
  if (now < next_sample_ms)
  {
    return;
  }
  next_sample_ms = (next_sample_ms == 0u) ? now + APP_SAMPLE_PERIOD_MS
                                          : next_sample_ms + APP_SAMPLE_PERIOD_MS;

  /* Einen kompletten Messdatensatz einsammeln: ein Zeitstempel, dann alle
   * Sensoren unmittelbar nacheinander -- so gehoeren die Werte einer
   * CSV-Zeile zeitlich auf <1 ms zusammen. Nicht bereite Module lassen
   * ihre Felder einfach auf 0 (memset oben). */
  app_sample_t sample;
  memset(&sample, 0, sizeof(sample));
  sample.timestamp_ms = now;
  (void)gnss_read(&sample.gnss);
  (void)brake_pressure_read(&sample.brake_pressure);
  (void)imu_lsm6dso_read(&sample.imu);
  (void)acc_adxl373_read(&sample.acc_400g);

  /* Datensatz als CSV-Zeile auf die microSD schreiben (falls Logging aktiv).
   * Ein Schreibfehler (Karte gezogen, Karte defekt) setzt den Fehlerzustand:
   * LED blinkt schnell, oben laeuft alle 2 s die Wiederherstellung. Waehrend
   * des Fehlers wird nicht weiter geschrieben -- diese Daten gehen verloren,
   * die Sensoren laufen aber weiter. APP_STATUS_NOT_READY (Logging gestoppt)
   * ist kein Fehler. */
  if (!app_sd_error &&
      storage_logger_write_sample(&sample) == APP_STATUS_ERROR)
  {
    app_sd_error = true;
    printf("[App] SD-Schreibfehler -- Aufzeichnung unterbrochen, versuche Wiederherstellung.\r\n");
  }
}
